'''11. Дано три змінні: X, Y, Z. Якщо їх значення впорядковані за спаданням, 
то подвоїти їх; в іншому випадку замінити значення кожної змінної на протилежне.'''

print('enter X, Y, Z:')
x=int(input())
y=int(input())
z=int(input())

if x>y>z:
    x*=2
    y*=2
    z*=2
else:
    x*=-1
    y*=-1
    z*=-1
print('new value:', x,y,z)