"""19. Знайти корені квадратного рівняння A • x^2 + B • x + C = 0,
заданого своїми коефіцієнтами A, B, C (A>0), якщо відомо,
що дискримінант рівняння позитивний. Вивести спочатку менший, а потім
більший із знайдених коренів. Коріння квадратного рівняння знаходяться за формулою x1, 2 =
(−B ± (D)1/2)/(2•A), де D - дискримінант, що дорівнює B2 − 4•A•C."""

print('enter A>0,B and C for A•x^2 + B•x + C = 0')
a=int(input())
b=int(input())
c=int(input())
import math
d=math.sqrt(b**2-(4*a*c))

x1=(-b+d)/(2*a)
x2=(-b-d)/(2*a)
print("x1 = ", min(x1, x2))
print("x2 = ", max(x1, x2))


