'''7. Дано рядок. Розріжте його на дві рівні частини (якщо довжина рядка - парна, а якщо довжина
рядка непарна, то довжина першої частини повинна бути на один символ більше). Переставте ці дві
частини місцями, результат запишіть в новий рядок і виведіть на екран.'''

s=str(input('enter string:  '))

if len(s)%2==0:
    s1 = s[:len(s)//2]
    s2 = s[len(s)//2:]
    print(s1,s2)
else:
    s1 = s[:len(s)//2+1]
    s2 = s[len(s)//2:-1]
    print(s1,s2)


a=s2+s1
print(a)